namespace backend_3_module.Data.Maps;

public class GarLevelTranslation
{
    public static readonly Dictionary<string, string> Levels = new Dictionary<string, string>
    {
        { "1", "Регион" },
        { "2", "Административный район" },
        { "3", "Муниципальный район" },
        { "4", "Сельское или городское поселение" },
        { "5", "Город" },
        { "6", "Населённый пункт" },
        { "7", "Элемент планировочной структуры" },
        { "8", "Элемент улично-дорожной сети" },
        { "9", "Земельный участок" },
        { "10", "Здание" },
        { "11", "Помещение" },
        { "12", "Часть помещения" },
        { "13", "Уровень автономного района" },
        { "14", "Внутригородской уровень" },
        { "15", "Уровень дополнительных территорий" },
        { "16", "Уровень объектов на дополнительных территориях" },
        { "17", "Машино-место" }
    };
}